In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('./complete-data.csv')
df2 = pd.read_csv('./processed/third.csv')

In [6]:
df2 = df2[['name', 'gender', 'character', 'movie name', 'mentions','count', 'total centrality', 'average centrality']]
df2.columns = ['name', 'gender', 'character', 'movie', 'mentions', 'count','total centrality', 'average centrality']
df2.head()

,name,gender,character,movie,mentions,count,total centrality,average centrality
0,seema_chetna,FEMALE,unrecognizable,Chetna,23.0,170.0,227.500000,1.338235
1,janki_geet,FEMALE,"sister, sister, sister",Geet,7.0,56.0,220.166667,3.931548
2,deepa_jeevan mrityu,FEMALE,"mother, mother, mother",Jeevan Mrityu,5.0,53.0,27.000000,0.509434
3,poonam_kati patang,FEMALE,real,Kati Patang,21.0,177.0,685.699553,3.874009
4,radha_khilona,FEMALE,young,Khilona,11.0,78.0,118.500000,1.519231

In [19]:
df1.columns = ['frame_number', 'gender', 'emotion', 'year', 'movie']
df1.head()

   frame_number gender emotion  year         movie
0            28  woman   happy  2014  dedh_ishqiya
1            62  woman   happy  2014  dedh_ishqiya
2            60    man   angry  2014  dedh_ishqiya
3            60    man     sad  2014  dedh_ishqiya
4            60    man   angry  2014  dedh_ishqiya

In [20]:
df1.head()

   frame_number gender emotion  year         movie
0            28  woman   happy  2014  dedh_ishqiya
1            62  woman   happy  2014  dedh_ishqiya
2            60    man   angry  2014  dedh_ishqiya
3            60    man     sad  2014  dedh_ishqiya
4            60    man   angry  2014  dedh_ishqiya

In [22]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4449 entries, 0 to 4448
Data columns (total 8 columns):
name                  4449 non-null object
gender                4449 non-null object
character             4449 non-null object
movie                 4449 non-null object
mentions              4449 non-null float64
count                 4449 non-null float64
total centrality      4449 non-null float64
average centrality    4449 non-null float64
dtypes: float64(4), object(4)
memory usage: 278.1+ KB

In [23]:
df1.to_csv(path_or_buf='./processed/emotion_movie_year.csv', index=True)

In [24]:
df2.to_csv(path_or_buf='./processed/fourth.csv', index=True)